
<!DOCTYPE HTML>
<html lang="fr" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>À Propos · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-language-picker/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="news.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Tapez pour rechercher" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    À Propos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="news.html">
            
                <a href="news.html">
            
                    
                    Nouvelles
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="install.html">
            
                <a href="install.html">
            
                    
                    Installation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="members.html">
            
                <a href="members.html">
            
                    
                    Membres
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="projects.html">
            
                <a href="projects.html">
            
                    
                    Projets
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="contribute.html">
            
                <a href="contribute.html">
            
                    
                    S'impliquer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="donations.html">
            
                <a href="donations.html">
            
                    
                    Faire un Don
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="contact.html">
            
                <a href="contact.html">
            
                    
                    Nous Contacter
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Publié avec GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >À Propos</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="association-de-citoyens-pour-des-communications-&#xE9;mancip&#xE9;es-s&#xE9;curis&#xE9;es-et-solidaires-access">Association de Citoyens pour des Communications &#xC9;mancip&#xE9;es, S&#xE9;curis&#xE9;es et Solidaires (ACCESS)</h1>
<p><em>Mission: D&#xE9;veloppement d&apos;outils de communication et d&apos;organisation bas&#xE9;s sur le protocole Secure-Scuttlebutt (SSB) en France.</em></p>
<blockquote>
<p>Scuttlebutt (anglais, familier): Comm&#xE9;rage de marins autour de la fontaine &#xE0; eau sur un bateau.</p>
</blockquote>
<p>Secure-Scuttlebutt (SSB) est un protocole de communication qui facilite la cr&#xE9;ation d&apos;applications sociales qui:</p>
<ul>
<li><em>ne n&#xE9;cessitent aucun compte dans une base de donn&#xE9;es centralis&#xE9;e</em>, seulement la cr&#xE9;ation locale d&apos;un identifiant et d&apos;une cl&#xE9; priv&#xE9;e associ&#xE9;e, contrairement &#xE0; la plupart des services Web d&apos;aujourd&apos;hui qui requi&#xE8;rent un compte courriel et la cr&#xE9;ation d&apos;un compte sur la plateforme;</li>
<li><em>ne n&#xE9;cessitent aucune plateforme de communication centralis&#xE9;e</em>, contrairement &#xE0; Facebook, Google, ou Twitter qui requi&#xE8;rent une connexion aux plateformes de ces compagnies incluant une surveillance constante des activit&#xE9;s des utilisateurs/utilisatrices &#xE0; des fins marketing;</li>
<li><em>restreignent les possibilit&#xE9;s de messages ind&#xE9;sirables</em> en ne propageant que les messages des membres du r&#xE9;seau social de son utilisateur/utilisatrice, contrairement au courriel qui permet l&apos;envoi de courriels ind&#xE9;sirables en masse (spam);</li>
<li><em>permettent les communications chiffr&#xE9;es entre utilisateurs/utilisatrices</em> sans r&#xE9;v&#xE9;ler les destinataires des messages, contrairement aux messageries conventionnelles qui, m&#xEA;me chiffr&#xE9;es, r&#xE9;v&#xE8;lent quand m&#xEA;me les participants des conversations;</li>
<li><em>permettent la sauvegarde et le partage s&#xE9;lectif d&apos;informations priv&#xE9;es</em>, accessibles seulement par l&apos;utilisateur/utilisatrice et les destinataires s&#xE9;lectionn&#xE9;s gr&#xE2;ce &#xE0; l&apos;utilisation de protocoles cryptographiques, contrairement aux messages &quot;priv&#xE9;s&quot; de nombreuses plateformes qui sont en fait accessibles &#xE0; l&apos;op&#xE9;rateur de la plateforme;</li>
<li><em>fonctionnent avec un acc&#xE8;s internet intermittent</em> en gardant une copie locale de tous les messages &#xE9;chang&#xE9;s pour maintenir les fonctionalit&#xE9;s m&#xEA;me hors connexion internet, contrairement &#xE0; la plupart des applications Web d&apos;aujourd&apos;hui;</li>
<li><em>sauvegardent automatiquement de mani&#xE8;re solidaire une copie des messages</em> chez les abonn&#xE9;s de l&apos;utilisateur/utilisatrice, ce qui permet une restauration automatique ult&#xE9;rieure en cas de perte des donn&#xE9;es originales (en autant que l&apos;utilisateur/utilisatrice poss&#xE8;de toujours sa cl&#xE9; priv&#xE9;e).</li>
</ul>
<p>Ce protocole a &#xE9;t&#xE9; cr&#xE9;&#xE9; en 2013 par Dominic Tarr pour profiter des avantages des applications sociales sur son voilier en Nouvelle-Z&#xE9;lande sans avoir &#xE0; faire les compromis requis par les m&#xE9;dias sociaux traditionnels.  La conception du protocole est similaire &#xE0; la fa&#xE7;on dont le comm&#xE9;rage permet la diffusion rapide de l&apos;information dans un r&#xE9;seau social. Cependant, &#xE0; la diff&#xE9;rence de ce dernier, l&apos;authenticit&#xE9; et l&apos;acc&#xE8;s &#xE0; l&apos;information sont garantis et contr&#xF4;l&#xE9;s par les derniers d&#xE9;veloppements en cryptographie. Une communaut&#xE9; grandissante d&apos;enthousiastes s&apos;en sert aujourd&apos;hui r&#xE9;guli&#xE8;rement pour des applications diverses comme:</p>
<ul>
<li>discuter r&#xE9;guli&#xE8;rement de mani&#xE8;re priv&#xE9;e en groupes restreints, en rempla&#xE7;ant le courriel ou l&apos;application Slack par l&apos;application Patchwork;</li>
<li>communiquer avec leur r&#xE9;seau social, en rempla&#xE7;ant Facebook ou Twitter par l&apos;application Patchwork;</li>
<li>tenir un blogue en rempla&#xE7;ant Blogspot ou Medium par l&apos;application Tick Tack;</li>
<li>cr&#xE9;er des d&#xE9;p&#xF4;ts pour la gestion du code source, en rempla&#xE7;ant GitHub ou GitLab par l&apos;outil git-ssb; </li>
<li>d&#xE9;velopper des modules JavaScript, en rempla&#xE7;ant NPM par l&apos;outil npm-ssb;</li>
<li>et m&#xEA;me jouer aux &#xE9;checs en utilisant ssb-chess!</li>
</ul>
<p>Bien que toutes ces applications aient fait leur preuves et soient utilis&#xE9;es quotidiennement de mani&#xE8;re fiable, ces exemples ne repr&#xE9;sentent que la pointe de l&apos;iceberg de tout ce qui est possible de r&#xE9;aliser autour du protocole Secure-Scuttlebutt. Les b&#xE9;n&#xE9;fices du protocole m&#xE9;riteraient d&apos;&#xEA;tre partag&#xE9;s avec un plus grand nombre de gens et appliqu&#xE9;s &#xE0; de nombreux autres domaines. </p>
<p>Le but de cette association fran&#xE7;aise est donc de promouvoir son utilisation dans l&apos;administration, la soci&#xE9;t&#xE9; civile, les associations, et les entreprises fran&#xE7;aises ainsi que de continuer son d&#xE9;veloppement pour &#xE9;tendre son utilisation &#xE0; une diversit&#xE9; de domaines au travers de nombreuses activit&#xE9;s incluant:</p>
<ul>
<li>la pr&#xE9;sentation, l&apos;installation, et la prise en main initiale des outils chez les nouveaux utilisateurs et nouvelles utilisatrices;</li>
<li>la mise en r&#xE9;seau de d&#xE9;veloppeurs d&apos;applications;</li>
<li>le support des organisations administratives, associatives, et commerciales;</li>
<li>le r&#xE9;seautage avec d&apos;autres associations fran&#xE7;aises oeuvrant dans des domaines compl&#xE9;mentaires;</li>
<li>l&apos;obtention de financements pour supporter les d&#xE9;veloppeurs se consacrant &#xE0; la recherche, au d&#xE9;veloppement, et la documentation sur les protocoles associ&#xE9;s ainsi que le d&#xE9;veloppement de nouvelles applications, en code ouvert et sans redevances;</li>
<li>la formation technique des utilisateurs et utilisatrices pour leur permettre d&apos;adapter les outils existants &#xE0; leurs besoins et de d&#xE9;velopper de nouvelles applications personnelles propres;</li>
<li>le d&#xE9;veloppement et la maintenance d&apos;infrastructures n&#xE9;cessaires au fonctionnement des applications et de l&apos;ensemble du r&#xE9;seau.</li>
</ul>
<p>L&apos;association est en d&#xE9;marrage et a besoin de votre aide, <a href="install.html">utilisez les applications compatibles</a>, <a href="contribute.html">impliquez-vous</a> et <a href="donations.html">faites un don</a>!</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="news.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Nouvelles">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"À Propos","level":"1.1","depth":1,"next":{"title":"Nouvelles","level":"1.2","depth":1,"path":"news.md","ref":"news.md","articles":[]},"dir":"ltr"},"config":{"plugins":["language-picker","github@2.0.0"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"language-picker":{"grid-columns":3},"github":{"url":"https://github.com/elavoie/scuttlebutt.fr"},"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"fr","gitbook":"*"},"file":{"path":"README.md","mtime":"2018-06-02T12:36:52.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-02T12:48:21.824Z"},"basePath":".","book":{"language":"fr"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-language-picker/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

